var a = 3;   //объявляем переменную по которой будем делать выборку
var x = "";  //объявляем переменную в которую будем записывать результат

switch (a) {
    case 1:                               // если a равна единице то записываем
        x = "Переменная a равна единице!";  // в переменную x фразу "Переменная a равна единице!"
        break;
    case 2:
        x = "Переменная a равна двум!";
        break;
    case 3:
        x = "Переменная a равна трем!";
        break;
    default:
        x = "Переменная a не равна 1, 2 или 3!";
}

alert(x);
